---

# <p style="font-family: serif; font-size:2.2em; text-align: center;"><u>Analyse des jeux de données data</u></p>

Ce document analyse les jeux de données fournies par la l'INSEE et par Data Gouv disponible ici

---

# Présentation projet Cliiink2

Dans la continuité du projet Cliiink, nous avons cherché de nouveaux jeux de données afin qu'une analyse socio-démographique puisse etre établie en fonction de chacune des villes de l'agglomération.

Nous avons repris les données de la population par ville, et nous les avons confrontés avec d'autres facteurs sociaux tels que les catégories socio-professionnelles ou le type de logement par ville. 
L'idée étant de comparer ces différents critères sociaux afin de faire ressortir un compte rendu par ville, et de comparer le tout avec le premier projet CLiiink. 
Cette conmparaison nous a permit de mettre en valeur la production plus ou moins importante de déchets selon la ville, en fonction de la catégorie initiallement étudiée.

Les données collectées proviennent majoritairement de l'Institut National de la Statistique et des Etudes Economiques.
À noter que l'INSEE établit ses études par cycle d'année. A titre d'exmple, la dernière étude menée pour établir la démographie de la population des villes de l'agglomération a été faite en 2017. Il s'agit donc du dernier jeu de données disponible et publié par l'organisme.

Pour des raisons de pratiques, nous modifions l'affichage d'origine des csv en indiquant les colonnes et les lignes qui nous intéresse. Nous pouvons ainsi focaliser notre études en retenant uniquement les données utiles à notre projet.
L'idée est d'afficher le résulat recherché de facon clair. L'INSEE étant un organisme publiant des données de niveau nationale, nous avons isolé du jeu de données uniquement les données qui nous intéresse, et les avons classés dans nos dataframes.

# Analyse des jeux de données data_sig_collecte

Ce document analyse les jeux de données que nous sommes allé chercher auprès de l'INSEE et de Data Gouv.

Il y a 4 jeux de données que nous avons utilisé :
    
* villes_data
* etablissements.csv
* naf2008_liste_n1
* naf2008_5_niveaux

### Importation des librairies

In [5]:
import pandas as pd
import json
from sqlalchemy import create_engine
from main import Bin_

### Lecture dus fichiers

In [3]:
#data_villes = pd.read_csv("/Users/a0000/Desktop/Cliink_Equipe2/Data/villes_data.csv", index_col= 0, sep=';', skiprows=0)
#entreprises_par_sa = pd.read_csv("/Users/a0000/Desktop/Cliink_Equipe2/Data/villes_data.csv", header=1 ,encoding="UTF-8", sep=',', skiprows=list(range(0, 2)) + list(range(14, 245)), usecols=[i for i in range(12)])
#entreprises_par_sa_ef = pd.read_csv("/Users/a0000/Desktop/Cliink_Equipe2/Data/villes_data.csv", header=16 ,encoding="UTF-8", sep=',', skiprows=list(range(15, 19)) + list(range(28, 245)), usecols=[i for i in range(31)])
#année_2017 = pd.read_csv("/Users/a0000/Desktop/Cliink_Equipe2/Data/villes_data.csv", header=30 ,encoding="UTF-8", sep=',', skiprows=list(range(29, 34)) + list(range(37, 245)), usecols=[i for i in range(14)])
#pop_age = pd.read_csv("/Users/a0000/Desktop/Cliink_Equipe2/Data/villes_data.csv", header=39 ,encoding="UTF-8", sep=',', skiprows=list(range(38, 41)) + list(range(50, 245)), usecols=[i for i in range(13)])
#emploi_femme = pd.read_csv("/Users/a0000/Desktop/Cliink_Equipe2/Data/villes_data.csv", header=145 ,encoding="UTF-8", sep=',', skiprows=list(range(145, 150)) + list(range(161, 245)), usecols=[i for i in range(7)])
#emploi_homme = pd.read_csv("/Users/a0000/Desktop/Cliink_Equipe2/Data/villes_data.csv", header=162 ,encoding="UTF-8", sep=',', skiprows=list(range(162, 167)) + list(range(178, 245)), usecols=[i for i in range(7)])
#chomage_sexe = pd.read_csv("/Users/a0000/Desktop/Cliink_Equipe2/Data/villes_data.csv", header=179 ,encoding="UTF-8", sep=',', skiprows=list(range(179, 184)) + list(range(190, 245)), usecols=[i for i in range(7)])
#taux_chomage_age = pd.read_csv("/Users/a0000/Desktop/Cliink_Equipe2/Data/villes_data.csv", header=192 ,encoding="UTF-8", sep=',', skiprows=list(range(191, 196)) + list(range(202, 245)), usecols=[i for i in range(13)])
CSP_15_24 = pd.read_csv("../Data/villes_data.csv", header=84 ,encoding="UTF-8", sep=',', skiprows=list(range(83, 88)) + list(range(99, 245)), usecols=[i for i in range(6)])
CSP_25_54 = pd.read_csv("../Data/villes_data.csv", header=101 ,encoding="UTF-8", sep=',', skiprows=list(range(100, 105)) + list(range(116, 245)), usecols=[i for i in range(6)])
CSP_55_plus = pd.read_csv("../Data/villes_data.csv", header=118 ,encoding="UTF-8", sep=',', skiprows=list(range(117, 122)) + list(range(133, 245)), usecols=[i for i in range(6)])
logement_par_catégorie = pd.read_csv("../Data/villes_data.csv", header=220 ,encoding="UTF-8", sep=',', skiprows=list(range(219, 224)) + list(range(230, 245)), usecols=[i for i in range(7)])
entreprise_csv = pd.read_csv("../Data/etablissements.csv")
code_naf = pd.read_excel("../Data/naf2008_liste_n1.xls", skiprows=list(range(0, 2)))
naf_5 = pd.read_excel("../Data/naf2008_5_niveaux.xls")

# On importe le fichier json pour rendre anonyme l'entrée de nos données personnelles lors de la connexion avec la base de données 
fichierConfig = "../Data/config.json" 
with open(fichierConfig) as fichier:config = json.load(fichier)["mysql"]
    
# On indique le nombre de lignes à afficher
#pd.options.display.max_rows = 5

/home/simplon/anaconda3/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3063: DtypeWarning: Columns (18,19,47,54,56,71) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

---

## Retour sur les décisons prises dans la sélection des csv

Le csv "data_villes" n'a pas été retenu pour le projet car il concerne uniquement les données des entreprises fondées en l'année 2020. 
Or pour que notre étude soit plus pertinente, nous avons jugé judiciable de travailler sur l'ensemble des entreprises de l'agglomération, et non pas uniquement celles crée récemment.

Après analyse de nos besoins, les csv suivants ne se sont pas révélés adéquats pour l'étude que l'on a voulu mené:

* année_2017
* pop_age
* emploi_femme
* emploi_homme
* chomage_sexe
* taux_chomage_age

Par ailleurs, les csv "entreprises_par_sa" et "entreprises_par_sa_ef" ont été remplacés par le csv "entreprise_csv", plus complet et précis.

---

# Jeu de données des CSP_15_24

### Aperçu du fichier

Il contient 6 variables que l'on pourra étudier :

* catégorie
* Mandelieu-La-Napoule
* Mougins
* Le Cannet
* Cannes
* Theoule-Sur-Mer

In [22]:
CSP_15_24

,Catégorie,Mandelieu-La-Napoule,Mougins,Le Cannet,Cannes,Theoule-Sur-Mer
0,Agriculteurs exploitants,0,0,0,0,0
1,Artisans. commerçants. chefs entreprise,16,34,26,40,5
...,...,...,...,...,...,...
7,Autres personnes sans activité professionnelle,1000,1049,2128,4519,63
8,Total,1993,1664,3662,7149,115

### Dimension du jeu de données

In [69]:
print("Le jeu de données recense", CSP_15_24.shape[0],"lignes par", CSP_15_24.shape[1], "colonnes")

Le jeu de données recense 9 lignes par 6 colonnes

### Valeurs manquantes

Le jeu de données est complet

In [70]:
CSP_15_24.isna().sum()

Catégorie               0
Mandelieu-La-Napoule    0
                       ..
Cannes                  0
Theoule-Sur-Mer         0
Length: 6, dtype: int64

### Décompte des doublons

In [71]:
CSP_15_24.duplicated().sum()

0

---

# Jeu de données des CSP_25_54

### Aperçu du fichier

Il contient 6 variables que l'on pourra étudier :

* catégorie
* Mandelieu-La-Napoule
* Mougins
* Le Cannet
* Cannes
* Theoule-Sur-Mer

In [23]:
CSP_25_54

,Catégorie,Mandelieu-La-Napoule,Mougins,Le Cannet,Cannes,Théoule-Sur-Mer
0,Agriculteurs exploitants,20,3,10,20,0
1,Artisans. commerçants. chefs entreprise,741,927,1225,2089,52
...,...,...,...,...,...,...
7,Autres personnes sans activité professionnelle,597,642,1845,3619,22
8,Total,8073,7941,15085,25189,497

### Dimension du jeu de données

In [66]:
print("Le jeu de données recense", CSP_25_54.shape[0],"lignes par", CSP_25_54.shape[1], "colonnes")

Le jeu de données recense 9 lignes par 6 colonnes

### Valeurs manquantes

Le jeu de données est complet

In [67]:
CSP_25_54.isna().sum()

Catégorie               0
Mandelieu-La-Napoule    0
                       ..
Cannes                  0
Théoule-Sur-Mer         0
Length: 6, dtype: int64

### Décompte des doublons

In [68]:
CSP_25_54.duplicated().sum()

0

---

# Jeu de données des CSP_55_plus

### Aperçu du fichier

Il contient 6 variables que l'on pourra étudier :

* catégorie
* Mandelieu-La-Napoule
* Mougins
* Le Cannet
* Cannes
* Theoule-Sur-Mer

In [24]:
CSP_55_plus

,Catégorie,Mandelieu-La-Napoule,Mougins,le Cannet,Cannes,Théoule-Sur-Mer
0,Agriculteurs exploitants,3,12,5,18,5
1,Artisans. commerçants. chefs entreprise,285,344,532,923,21
...,...,...,...,...,...,...
7,Autres personnes sans activité professionnelle,615,504,1297,2993,64
8,Total,9305,6607,17155,31161,623

### Dimension du jeu de données

In [63]:
print("Le jeu de données recense", CSP_55_plus.shape[0],"lignes pour", CSP_55_plus.shape[1], "colonnes")

Le jeu de données recense 9 lignes pour 6 colonnes

### Valeurs manquantes

Le jeu de données est complet

In [64]:
CSP_55_plus.isna().sum()

Catégorie               0
Mandelieu-La-Napoule    0
                       ..
Cannes                  0
Théoule-Sur-Mer         0
Length: 6, dtype: int64

### Décompte des doublons

In [65]:
CSP_55_plus.duplicated().sum()

0

---

# Jeu de données des logement_par_catégorie

### Aperçu du fichier

Il contient 7 variables que l'on pourra étudier :

* catégorie
* France
* Mandelieu-La-Napoule
* Mougins
* Le Cannet
* Cannes
* Theoule-Sur-Mer

In [25]:
logement_par_catégorie

,Catégorie,France,Mandelieu-la-Napoule,Mougins,Le Cannet,Cannes,Théoule-sur-Mer
0,Résidences principales,29479746,11339,8403,21276,37735,694
1,Résid. secondaires et log. occasionnels,3464523,8694,1983,4104,31433,2564
2,Logements vacants,2935447,1201,501,940,2096,77
3,Total,35879716,21234,10887,26320,71264,3335

### Dimension du jeu de données

In [62]:
print("Le jeu de données recense", logement_par_catégorie.shape[0],"catégories pour", logement_par_catégorie.shape[1],"colonnes")

Le jeu de données recense 4 catégories pour 7 colonnes

### Valeurs manquantes

Le jeu de données est complet

In [54]:
logement_par_catégorie.isna().sum()

Catégorie          0
France             0
                  ..
Cannes             0
Théoule-sur-Mer    0
Length: 7, dtype: int64

### Décompte des doublons

In [55]:
logement_par_catégorie.duplicated().sum()

0

---

# Jeu de données des entreprise_csv

### Aperçu du fichier

Il contient 76 variables que l'on pourra étudier :

* siren
* nic
* siret
* statutDiffusionEtablissement
* dateCreationEtablissement
* trancheEffectifsEtablissement
* anneeEffectifsEtablissement
* activitePrincipaleRegistreMetiersEtablissement
* dateDernierTraitementEtablissement
* etablissementSiege
* etatAdministratifUniteLegale
* statutDiffusionUniteLegale
* unitePurgeeUniteLegale
* dateCreationUniteLegale
* categorieJuridiqueUniteLegale 
* denominationUniteLegale
* sigleUniteLegale
* denominationUsuelle1UniteLegale
* denominationUsuelle2UniteLegale
* denominationUsuelle3UniteLegale
* sexeUniteLegale
* nomUniteLegale
* nomUsageUniteLegale
* prenom1UniteLegale
* prenom2UniteLegale
* prenom3UniteLegale
* prenom4UniteLegale
* prenomUsuelUniteLegale
* pseudonymeUniteLegale
* activitePrincipaleUniteLegale
* nomenclatureActivitePrincipaleUniteLegale
* identifiantAssociationUniteLegale
* economieSocialeSolidaireUniteLegale
* caractereEmployeurUniteLegale
* trancheEffectifsUniteLegale
* anneeEffectifsUniteLegale
* nicSiegeUniteLegale
* dateDernierTraitementUniteLegale
* categorieEntreprise
* anneeCategorieEntreprise
* complementAdresseEtablissement
* numeroVoieEtablissement
* indiceRepetitionEtablissement
* typeVoieEtablissement
* libelleVoieEtablissement
* codePostalEtablissement
* libelleCommuneEtablissement
* libelleCommuneEtrangerEtablissement
* distributionSpecialeEtablissement
* codeCommuneEtablissement
* codeCedexEtablissement
* libelleCedexEtablissement
* codePaysEtrangerEtablissement
* libellePaysEtrangerEtablissement
* complementAdresse2Etablissement
* numeroVoie2Etablissement
* indiceRepetition2Etablissement
* typeVoie2Etablissement
* libelleVoie2Etablissement
* codePostal2Etablissement
* libelleCommune2Etablissement
* libelleCommuneEtranger2Etablissement
* distributionSpeciale2Etablissement
* codeCommune2Etablissement
* codeCedex2Etablissement
* libelleCedex2Etablissement
* codePaysEtranger2Etablissement
* libellePaysEtranger2Etablissement
* etatAdministratifEtablissement
* enseigne1Etablissement
* enseigne2Etablissement
* enseigne3Etablissement
* denominationUsuelleEtablissement
* activitePrincipaleEtablissement
* nomenclatureActivitePrincipaleEtablissement
* caractereEmployeurEtablissement

In [26]:
#entreprise_csv.head(5)

,siren,nic,siret,statutDiffusionEtablissement,dateCreationEtablissement,trancheEffectifsEtablissement,anneeEffectifsEtablissement,activitePrincipaleRegistreMetiersEtablissement,dateDernierTraitementEtablissement,etablissementSiege,...,codePaysEtranger2Etablissement,libellePaysEtranger2Etablissement,etatAdministratifEtablissement,enseigne1Etablissement,enseigne2Etablissement,enseigne3Etablissement,denominationUsuelleEtablissement,activitePrincipaleEtablissement,nomenclatureActivitePrincipaleEtablissement,caractereEmployeurEtablissement
0,6310965,22,631096500022,O,1982-08-10,NN,NaN,NaN,2019-11-14T14:00:15,True,...,NaN,NaN,A,NaN,NaN,NaN,NaN,68.20A,NAFRev2,N
1,15580079,34,1558007900034,O,2004-06-29,NN,NaN,NaN,2008-01-04T17:54:54,False,...,NaN,NaN,A,NaN,NaN,NaN,NaN,68.20B,NAFRev2,N
2,19760123,18,1976012300018,O,1995-12-25,NaN,NaN,NaN,2008-01-04T17:55:07,True,...,NaN,NaN,A,NaN,NaN,NaN,NaN,81.10Z,NAFRev2,N
3,19760149,13,1976014900013,O,1995-12-25,01,2018.0,NaN,2020-08-25T10:10:23,True,...,NaN,NaN,A,NaN,NaN,NaN,NaN,81.10Z,NAFRev2,O
4,19760206,11,1976020600011,O,1995-12-25,NN,NaN,NaN,2019-04-03T08:47:15,True,...,NaN,NaN,A,NaN,NaN,NaN,NaN,81.10Z,NAFRev2,N

### Dimension du jeu de données

In [42]:
print("Le jeu de données recense", entreprise_csv.shape[0],"entreprises pour", entreprise_csv.shape[1], "colonnes")

Le jeu de données recense 54642 entreprises pour 76 colonnes

### Valeurs manquantes

Le jeu de données est complet

In [51]:
entreprise_csv.isna().sum()

siren                                          0
nic                                            0
                                              ..
nomenclatureActivitePrincipaleEtablissement    0
caractereEmployeurEtablissement                1
Length: 76, dtype: int64

### Décompte des doublons

In [50]:
entreprise_csv.duplicated().sum()

0

---

# Jeu de données des code_naf

### Aperçu du fichier

Il contient 2 variables que l'on pourra étudier :

* Code
* Libellé

In [27]:
code_naf

   Code                                            Libellé
0     A                 Agriculture, sylviculture et pêche
1     B                             Industries extractives
..  ...                                                ...
19    T  Activités des ménages en tant qu'employeurs ; ...
20    U                      Activités extra-territoriales

[21 rows x 2 columns]

### Dimension du jeu de données

In [45]:
print("Le jeu de données recense", code_naf.shape[0],"codes par", code_naf.shape[1], "libellé")

Le jeu de données recense 21 codes par 2 libellé

### Valeurs manquantes

Le jeu de données est complet

In [46]:
code_naf.isna().sum()

Code       0
Libellé    0
dtype: int64

### Décompte des doublons

In [47]:
code_naf.duplicated().sum()

0

---

# Jeu de données des naf_5

### Aperçu du fichier

Il contient 5 variables que l'on pourra étudier :

* NIV5
* NIV4
* NIV3
* NIV2
* NIV1

In [28]:
naf_5

       NIV5   NIV4  NIV3  NIV2 NIV1
0    01.11Z   1.11   1.1     1    A
1    01.12Z   1.12   1.1     1    A
..      ...    ...   ...   ...  ...
730  98.20Z  98.20  98.2    98    T
731  99.00Z  99.00  99.0    99    U

[732 rows x 5 columns]

### Dimension du jeu de données

In [72]:
print("Le jeu de données recense", naf_5.shape[0],"lignes avec", naf_5.shape[1], "niveaux")

Le jeu de données recense 732 lignes avec 5 niveaux

### Valeurs manquantes

Le jeu de données est complet

In [73]:
naf_5.isna().sum()

NIV5    0
NIV4    0
NIV3    0
NIV2    0
NIV1    0
dtype: int64

### Décompte des doublons

In [74]:
naf_5.duplicated().sum()

0

---

# <p style="font-family: serif; font-size:2.2em; text-align: center;"><u>Création des DataFrames</u></p>

La création des DataFrames nous permettra d'établir la connection et le chargement des données directement depuis les tables de notre base de données.

## Création du DataFrame ville

In [77]:
liste_ville_id = [1,2,3,4,5]
liste_ville_nom = ['Cannes', 'Le Cannet', 'Mougins', 'Mandelieu-La-Napoule', 'Theoule-Sur-Mer']
ville = pd.DataFrame({'vi_id': liste_ville_id,
                     'vi_nom': liste_ville_nom})

In [78]:
# Apercu du DataFrame ville
ville

   vi_id                vi_nom
0      1                Cannes
1      2             Le Cannet
2      3               Mougins
3      4  Mandelieu-La-Napoule
4      5       Theoule-Sur-Mer

---

## Création du DataFrame entreprise

In [84]:
# On affiche les adresses en minuscule
entreprise_csv["denominationUniteLegale"] = entreprise_csv["denominationUniteLegale"].str.lower()
# Rectification des code postaux
entreprise_csv["codePostalEtablissement"] = "0" + entreprise_csv["codePostalEtablissement"].astype(str)
# On affiche le nom des villes en minuscule
entreprise_csv["libelleCommuneEtablissement"] = entreprise_csv["libelleCommuneEtablissement"].str.title()
# On affiche les abbreviations des types de voie en minuscule
entreprise_csv["typeVoieEtablissement"] = entreprise_csv["typeVoieEtablissement"].str.lower()
# On affiche les nom des rue en minuscule
entreprise_csv["libelleVoieEtablissement"] = entreprise_csv["libelleVoieEtablissement"].str.lower()

In [85]:
# Création du dictionnaire naf
naf = {}
for i in naf_5.index:
    # Ajout paire clé-valeur
    naf.update({naf_5.iloc[i]['NIV5']: naf_5.loc[i]['NIV1']})

# Création du dictionnaire secteur d'activité
SectAct = {}
for i in code_naf.index:
    # Ajout paire clé-valeur
    SectAct.update({code_naf.iloc[i]['Code']: code_naf.index[i]+1})
    
# Création du dictionnaire des villes
dict_ville = {}
for i in ville.index:
    dict_ville.update({ville.loc[i]['vi_nom']: ville.loc[i]['vi_id']})

In [86]:
# Création du DataFrame entreprise
entreprise = pd.DataFrame(columns =['en_id','en_siren','en_nic', 'en_nom', 'en_sa_id_fk', 'en_adresse', 'en_code_postal', 'en_vi_id_fk'])

#for i in entreprise_csv.index:
for i in range(2000):
    en_id = int(str(entreprise_csv.loc[i]["siren"]) + str(entreprise_csv.loc[i]["nic"]))
    siren = entreprise_csv.iloc[i]['siren']
    nic = entreprise_csv.iloc[i]['nic']
    nom = entreprise_csv.iloc[i]['denominationUniteLegale']
    # Utilisation du dictionaire naf pour répertorier les secteurs d'activité
    a = naf[entreprise_csv.loc[i]["activitePrincipaleEtablissement"]]
    # Utilisation du dictionaire naf SectAct pour réferencer le secteur d'activité
    secteur_activite = SectAct[a]
    
    
    # Ici on test si le numero de voie est non nul/ si oui on le remplace par un str vide
    adresse = (''if pd.isna(entreprise_csv.iloc[i]['numeroVoieEtablissement'])
    # /sinon on le transforme en int pour supprimer les chiffres apres la virgule puis en str
 else str(int(entreprise_csv.iloc[i]['numeroVoieEtablissement'])))+" "+str(entreprise_csv.loc[i]["typeVoieEtablissement"])+" "+str(entreprise_csv.loc[i]["libelleVoieEtablissement"])
    
    
    code_postal = entreprise_csv.loc[i]["codePostalEtablissement"]
    en_ville = dict_ville[entreprise_csv.loc[i]["libelleCommuneEtablissement"]]
    
    df = pd.DataFrame({'en_id': en_id,
                           'en_siren': siren,
                           'en_nic': nic,
                           'en_nom': nom,
                           'en_sa_id_fk': secteur_activite,
                           'en_adresse': adresse,
                           'en_code_postal':code_postal,
                           'en_vi_id_fk':en_ville}, index = [0])
    entreprise = entreprise.append(df, ignore_index=True)

In [87]:
# Apercu du DataFrame entreprise
entreprise

,en_id,en_siren,en_nic,en_nom,en_sa_id_fk,en_adresse,en_code_postal,en_vi_id_fk
0,631096522,6310965,22,NaN,12,av gaston de fontmichel,06210,4
1,1558007934,15580079,34,societe immobiliere walter sperger,12,2 bd leader,06150,1
...,...,...,...,...,...,...,...,...
1998,32131425412,321314254,12,soc particuliere janau,12,70 rue georges clemenceau,06400,1
1999,32133932717,321339327,17,NaN,17,23 rue jean de riouffe,06400,1

---

## Création du DataFrame secteur_activite

In [88]:
# On utilise le fichier code naf pour le DataFrame secteur activité
secteur_activite = pd.DataFrame(code_naf, columns = ["sa_id", "Libellé"])
secteur_activite["sa_id"] = secteur_activite.index + 1
secteur_activite.rename(columns={"Libellé": "sa_nom"},inplace=True)

In [89]:
# Apercu du DataFrame sesecteur_activite
secteur_activite

    sa_id                                             sa_nom
0       1                 Agriculture, sylviculture et pêche
1       2                             Industries extractives
..    ...                                                ...
19     20  Activités des ménages en tant qu'employeurs ; ...
20     21                      Activités extra-territoriales

[21 rows x 2 columns]

---

## Création du DataFrame categorie_socio_pro

In [90]:
# On utilise le fichier CSP_15_24 pour le DataFrame categorie_socio_pro
categorie_socio_pro = pd.DataFrame(CSP_15_24, columns =["csp_id","Catégorie"])
categorie_socio_pro["csp_id"] = categorie_socio_pro.index + 1
categorie_socio_pro.rename(columns = {"Catégorie": "csp_nom"},inplace=True)

In [91]:
# Apercu du DataFrame categorie_socio_pro
categorie_socio_pro

    csp_id                                         csp_nom
0        1                        Agriculteurs exploitants
1        2         Artisans. commerçants. chefs entreprise
..     ...                                             ...
7        8  Autres personnes sans activité professionnelle
8        9                                           Total

[9 rows x 2 columns]

---

## Création du DataFrame age

In [92]:
liste_ag_id = [1,2,3]
liste_ag_nom = ["15 a 24", "25 a 54","55 et plus"]
age = pd.DataFrame({'ag_id': liste_ag_id,
                     'ag_tranche_age': liste_ag_nom})

In [93]:
# Apercu du DataFrame age
age

   ag_id ag_tranche_age
0      1        15 a 24
1      2        25 a 54
2      3     55 et plus

---

## Création du DataFrame age du DataFrame population

In [94]:
# On rectifie l'ortographe de la colonne Theoule-Sur-Mer
CSP_25_54.rename(columns={"Théoule-Sur-Mer": "Theoule-Sur-Mer"}, inplace = True)
CSP_55_plus.rename(columns={"Théoule-Sur-Mer": "Theoule-Sur-Mer"}, inplace = True)
# On rectifie l'ortographe de la colonne Le Cannet
CSP_55_plus.rename(columns={"le Cannet": "Le Cannet"}, inplace = True)

In [95]:
# Création d'une fonction add_df qui renvoie un DataFrame adapté pour la table population
def add_df(df):
    # Création d'un DataFrame adapté pour la table population
    dataf = pd.DataFrame(columns = ["po_id","po_source", "po_annee", "po_nbre_pop", "po_csp_id_fk", "po_ag_id_fk", "po_vi_id_fk"])
    # Dans une premiere boucle on itère sur le nbre de ligne qui correcpond à csp
    for i in df.index:
        # Dans une deuxieme boucle imbriquer on itère sur le nbre de colonne qui correspond aux villes
        for j in df.columns[1:]:
            nbre = df.iloc[i][j]
            ville1 = dict_ville[j]
            csp = i + 1
            DF = pd.DataFrame({'po_id': i,
                           'po_source': "Insee, Recensement de la population (RP), exploitation complémentaire - 2017",
                           'po_annee': 2017,
                           'po_nbre_pop': nbre,
                           'po_csp_id_fk': csp,
                           'po_vi_id_fk': ville1}, index = [0])
            dataf = dataf.append(DF, ignore_index=True)
    return dataf

In [96]:
# On utilise la fonction add_df pour creer des dataframe en fonction de la tranche d'age
population15_24 = add_df(CSP_15_24)
population25_54 = add_df(CSP_25_54)
population55_plus = add_df(CSP_55_plus)

# On assigne la clé entrangère de la table age
password = Bin_(config["password"])._UserP()
population15_24['po_ag_id_fk']=1
population25_54['po_ag_id_fk']=2
population55_plus['po_ag_id_fk']=3

# On réunis les 3 DataFrames dans le DataFrame poplulation
population = pd.concat([population15_24,population25_54,population55_plus])
population.reset_index(inplace = True)
population['po_id'] = population.index
population.drop(columns=['index'], inplace=True)

# On modifie le type de po_année
# population['po_annee']= pd.to_datetime(population['po_annee'], format="%Y")

In [97]:
# Apercu du DataFrame population
population

,po_id,po_source,po_annee,po_nbre_pop,po_csp_id_fk,po_ag_id_fk,po_vi_id_fk
0,0,"Insee, Recensement de la population (RP), expl...",2017,0,1,1,4
1,1,"Insee, Recensement de la population (RP), expl...",2017,0,1,1,3
...,...,...,...,...,...,...,...
133,133,"Insee, Recensement de la population (RP), expl...",2017,31161,9,3,1
134,134,"Insee, Recensement de la population (RP), expl...",2017,623,9,3,5

---

## Création du DataFrame categorie_logement

In [98]:
# On utilise le fichier logement_par_catégorie pour le DataFrame categorie_logement
categorie_logement = pd.DataFrame(logement_par_catégorie, columns =["cl_id","Catégorie"])
categorie_logement["cl_id"] = categorie_logement.index + 1
categorie_logement.rename(columns = {"Catégorie": "cl_nom"},inplace=True)

In [99]:
# Apercu du DataFrame categorie_logement
categorie_logement

   cl_id                                   cl_nom
0      1                   Résidences principales
1      2  Résid. secondaires et log. occasionnels
2      3                        Logements vacants
3      4                                    Total

---

## Création du DataFrame logement

In [100]:
# On rectifie l'ortographe de la colonne Mandelieu-la-Napoule
logement_par_catégorie.rename(columns={"Mandelieu-la-Napoule": "Mandelieu-La-Napoule"}, inplace = True)
# On rectifie l'ortographe de la colonne Theoule-Sur-Mer
logement_par_catégorie.rename(columns={"Théoule-sur-Mer": "Theoule-Sur-Mer"}, inplace = True)

In [101]:
# Création du DataFrame logement
logement = pd.DataFrame(columns = ["lo_id","lo_nbre","lo_vi_id_fk","lo_cl_id_fk"])

for i in logement_par_catégorie.index:
    for j in logement_par_catégorie.columns[2:]:
        nbre_lg = logement_par_catégorie.iloc[i][j]
        ville_lg = dict_ville[j]
        type_lg = i +1
        df_lg = pd.DataFrame({'lo_nbre': nbre_lg,
                           'lo_vi_id_fk': ville_lg,
                           'lo_cl_id_fk': type_lg}, index = [0])
        logement = logement.append(df_lg, ignore_index=True)
        
logement['lo_id'] = logement.index + 1

In [102]:
# Apercu du DataFrame logement
logement

    lo_id lo_nbre lo_vi_id_fk lo_cl_id_fk
0       1   11339           4           1
1       2    8403           3           1
..    ...     ...         ...         ...
18     19   71264           1           4
19     20    3335           5           4

[20 rows x 4 columns]

### Exemple de boucle :

In [103]:
for i in logement_par_catégorie.index:
    for j in logement_par_catégorie.columns[2:]:
        print("le chiffre est :   ", logement_par_catégorie.iloc[i][j],";\tla logement_par_catégorie est :", i,";\t la ville est :", str(j))

le chiffre est :    11339 ;	la logement_par_catégorie est : 0 ;	 la ville est : Mandelieu-La-Napoule
le chiffre est :    8403 ;	la logement_par_catégorie est : 0 ;	 la ville est : Mougins
le chiffre est :    21276 ;	la logement_par_catégorie est : 0 ;	 la ville est : Le Cannet
le chiffre est :    37735 ;	la logement_par_catégorie est : 0 ;	 la ville est : Cannes
le chiffre est :    694 ;	la logement_par_catégorie est : 0 ;	 la ville est : Theoule-Sur-Mer
le chiffre est :    8694 ;	la logement_par_catégorie est : 1 ;	 la ville est : Mandelieu-La-Napoule
le chiffre est :    1983 ;	la logement_par_catégorie est : 1 ;	 la ville est : Mougins
le chiffre est :    4104 ;	la logement_par_catégorie est : 1 ;	 la ville est : Le Cannet
le chiffre est :    31433 ;	la logement_par_catégorie est : 1 ;	 la ville est : Cannes
le chiffre est :    2564 ;	la logement_par_catégorie est : 1 ;	 la ville est : Theoule-Sur-Mer
le chiffre est :    1201 ;	la logement_par_catégorie est : 2 ;	 la ville est : Mandelieu-La-Napoule
le chiffre est :    501 ;	la logement_par_catégorie est : 2 ;	 la ville est : Mougins
le chiffre est :    940 ;	la logement_par_catégorie est : 2 ;	 la ville est : Le Cannet
le chiffre est :    2096 ;	la logement_par_catégorie est : 2 ;	 la ville est : Cannes
le chiffre est :    77 ;	la logement_par_catégorie est : 2 ;	 la ville est : Theoule-Sur-Mer
le chiffre est :    21234 ;	la logement_par_catégorie est : 3 ;	 la ville est : Mandelieu-La-Napoule
le chiffre est :    10887 ;	la logement_par_catégorie est : 3 ;	 la ville est : Mougins
le chiffre est :    26320 ;	la logement_par_catégorie est : 3 ;	 la ville est : Le Cannet
le chiffre est :    71264 ;	la logement_par_catégorie est : 3 ;	 la ville est : Cannes
le chiffre est :    3335 ;	la logement_par_catégorie est : 3 ;	 la ville est : Theoule-Sur-Mer

### Analyse du jeu de données

In [104]:
print("Le jeu de donnees compte", entreprise.shape[0], "entreprises localisées dans les ", ville.shape[0], "villes de l'agglomération.")

Le jeu de donnees compte 2000 entreprises localisées dans les  5 villes de l'agglomération.

### Décompte des secteurs d'activités

In [137]:
en_vc = entreprise['en_nom'].value_counts()
en_vc.head(5)

commune de cannes                   56
commune le cannet                   25
commune de mandelieu la napoule     17
commune de mougins                  16
centre communal d'action sociale    15
Name: en_nom, dtype: int64

### Générer le résumé statistique du dataframe

In [106]:
population.describe(include='all')

,po_id,po_source,po_annee,po_nbre_pop,po_csp_id_fk,po_ag_id_fk,po_vi_id_fk
count,135.0,135,135.0,135.0,135.0,135.0,135.0
unique,NaN,1,1.0,110.0,9.0,NaN,5.0
...,...,...,...,...,...,...,...
75%,100.5,NaN,NaN,NaN,NaN,3.0,NaN
max,134.0,NaN,NaN,NaN,NaN,3.0,NaN

In [107]:
entreprise.describe(include='all')

,en_id,en_siren,en_nic,en_nom,en_sa_id_fk,en_adresse,en_code_postal,en_vi_id_fk
count,2000,2000,2000,1410,2000,2000,2000,2000
unique,2000,1703,320,1144,18,1535,6,5
top,30774860814,210600292,14,commune de cannes,14,pl de l hotel de ville,06400,1
freq,1,56,104,56,521,13,1003,1210

---

# <p style="font-family: serif; font-size:2.2em; text-align: center;"><u>Data Cleaning DataFrames</u></p>

L'Institut national de la statistique et des études économiques est une direction générale du ministère de l'Économie et des Finances. Il a pour mission de collecter, analyser et diffuser des informations sur l'économie et la société française sur l'ensemble de son territoire.

L'INSEE est ainsi un organisme qui publie des statistiques officielles. Les données qui en ressortent sont dons déjà fiables, néttoyées. Les csv ne devraient donc pas nécessairement avoir besoin d'etre nottoyés.

Pour pour s'assurer de l'intégrité de nos données, nous allons tout de meme y mener quelques vérifications.

# Décompte des valeurs manquantes

### Dataframe Ville

In [80]:
ville.isna().sum()

vi_id     0
vi_nom    0
dtype: int64

In [81]:
ville.duplicated().sum()

0

---

### Dataframe secteur_activite

In [117]:
secteur_activite.isna().sum()

sa_id     0
sa_nom    0
dtype: int64

In [118]:
secteur_activite.duplicated().sum()

0

---

### Dataframe categorie_socio_pro

In [119]:
categorie_socio_pro.isna().sum()

csp_id     0
csp_nom    0
dtype: int64

In [120]:
categorie_socio_pro.duplicated().sum()

0

---

### Dataframe age

In [121]:
age.isna().sum()

ag_id             0
ag_tranche_age    0
dtype: int64

In [122]:
age.duplicated().sum()

0

---

### Dataframe categorie_logement

In [123]:
categorie_logement.isna().sum()

cl_id     0
cl_nom    0
dtype: int64

In [124]:
categorie_logement.duplicated().sum()

0

---

### Dataframe logement

In [125]:
logement.isna().sum()

lo_id          0
lo_nbre        0
lo_vi_id_fk    0
lo_cl_id_fk    0
dtype: int64

In [126]:
logement.duplicated().sum()

0

---

### Dataframe population

In [113]:
population.isna().sum()

po_id          0
po_source      0
              ..
po_ag_id_fk    0
po_vi_id_fk    0
Length: 7, dtype: int64

In [130]:
population.duplicated().sum()

0

---

### Dataframe entreprise

In [128]:
entreprise.isna().sum()

en_id             0
en_siren          0
                 ..
en_code_postal    0
en_vi_id_fk       0
Length: 8, dtype: int64

In [131]:
entreprise.duplicated().sum()

0

---

Les jeu de données est complet. Il n'y a pas besoin de droper de doublons par exemple.

Nous pouvons procéder à l'intégration des données dans la base de données.

---

# <p style="font-family: serif; font-size:2.2em; text-align: center;"><u>Connexion et insertion des données dans la BDD</u></p>

## Connexion à la base de données sur Workbench

In [47]:
engine = create_engine('mysql+' + config["connector"] + '://' + config["user"] + ":" + password + "@" + config["host"] + ":" + config["port"] + "/" + config["bdd"], echo=True)

In [48]:
ville.to_sql('ville', con=engine, if_exists='append', index=False)

2020-12-02 22:33:00,731 INFO sqlalchemy.engine.base.Engine SHOW VARIABLES LIKE 'sql_mode'
2020-12-02 22:33:00,733 INFO sqlalchemy.engine.base.Engine {}
2020-12-02 22:33:00,738 INFO sqlalchemy.engine.base.Engine SHOW VARIABLES LIKE 'lower_case_table_names'
2020-12-02 22:33:00,739 INFO sqlalchemy.engine.base.Engine {}
2020-12-02 22:33:00,745 INFO sqlalchemy.engine.base.Engine SELECT DATABASE()
2020-12-02 22:33:00,748 INFO sqlalchemy.engine.base.Engine {}
2020-12-02 22:33:00,754 INFO sqlalchemy.engine.base.Engine show collation where `Charset` = 'utf8mb4' and `Collation` = 'utf8mb4_bin'
2020-12-02 22:33:00,757 INFO sqlalchemy.engine.base.Engine {}
2020-12-02 22:33:00,764 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS CHAR(60)) AS anon_1
2020-12-02 22:33:00,766 INFO sqlalchemy.engine.base.Engine {}
2020-12-02 22:33:00,772 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS CHAR(60)) AS anon_1
2020-12-02 22:33:00,777 INFO sqlalchemy.engine.base.Engine {}
2020-12-02 22:33:00,780 INFO sqlalchemy.engine.base.Engine SELECT CAST('test collated returns' AS CHAR CHARACTER SET utf8mb4) COLLATE utf8mb4_bin AS anon_1
2020-12-02 22:33:00,782 INFO sqlalchemy.engine.base.Engine {}
2020-12-02 22:33:00,789 INFO sqlalchemy.engine.base.Engine DESCRIBE `ville`
2020-12-02 22:33:00,791 INFO sqlalchemy.engine.base.Engine {}
2020-12-02 22:33:00,797 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2020-12-02 22:33:00,801 INFO sqlalchemy.engine.base.Engine INSERT INTO ville (vi_id, vi_nom) VALUES (%(vi_id)s, %(vi_nom)s)
2020-12-02 22:33:00,803 INFO sqlalchemy.engine.base.Engine ({'vi_id': 1, 'vi_nom': 'Cannes'}, {'vi_id': 2, 'vi_nom': 'Le Cannet'}, {'vi_id': 3, 'vi_nom': 'Mougins'}, {'vi_id': 4, 'vi_nom': 'Mandelieu-La-Napoule'}, {'vi_id': 5, 'vi_nom': 'Theoule-Sur-Mer'})
2020-12-02 22:33:00,805 INFO sqlalchemy.engine.base.Engine COMMIT

In [49]:
secteur_activite.to_sql('secteur_activite', con=engine, if_exists='append', index=False)

2020-12-02 22:33:00,831 INFO sqlalchemy.engine.base.Engine DESCRIBE `secteur_activite`
2020-12-02 22:33:00,833 INFO sqlalchemy.engine.base.Engine {}
2020-12-02 22:33:00,841 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2020-12-02 22:33:00,843 INFO sqlalchemy.engine.base.Engine INSERT INTO secteur_activite (sa_id, sa_nom) VALUES (%(sa_id)s, %(sa_nom)s)
2020-12-02 22:33:00,844 INFO sqlalchemy.engine.base.Engine ({'sa_id': 1, 'sa_nom': 'Agriculture, sylviculture et pêche'}, {'sa_id': 2, 'sa_nom': 'Industries extractives'}, {'sa_id': 3, 'sa_nom': 'Industrie manufacturière'}, {'sa_id': 4, 'sa_nom': "Production et distribution d'électricité, de gaz, de vapeur et d'air conditionné"}, {'sa_id': 5, 'sa_nom': "Production et distribution d'eau ; assainissement, gestion des déchets et dépollution"}, {'sa_id': 6, 'sa_nom': 'Construction'}, {'sa_id': 7, 'sa_nom': "Commerce ; réparation d'automobiles et de motocycles"}, {'sa_id': 8, 'sa_nom': 'Transports et entreposage'}  ... displaying 10 of 21 total bound parameter sets ...  {'sa_id': 20, 'sa_nom': "Activités des ménages en tant qu'employeurs ; activités indifférenciées des ménages en tant que producteurs de biens et services pour usage propre"}, {'sa_id': 21, 'sa_nom': 'Activités extra-territoriales'})
2020-12-02 22:33:00,850 INFO sqlalchemy.engine.base.Engine COMMIT

In [50]:
categorie_socio_pro.to_sql('categorie_socio_pro', con=engine, if_exists='append', index=False)

2020-12-02 22:33:00,865 INFO sqlalchemy.engine.base.Engine DESCRIBE `categorie_socio_pro`
2020-12-02 22:33:00,867 INFO sqlalchemy.engine.base.Engine {}
2020-12-02 22:33:00,877 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2020-12-02 22:33:00,879 INFO sqlalchemy.engine.base.Engine INSERT INTO categorie_socio_pro (csp_id, csp_nom) VALUES (%(csp_id)s, %(csp_nom)s)
2020-12-02 22:33:00,881 INFO sqlalchemy.engine.base.Engine ({'csp_id': 1, 'csp_nom': 'Agriculteurs exploitants'}, {'csp_id': 2, 'csp_nom': 'Artisans. commerçants. chefs entreprise'}, {'csp_id': 3, 'csp_nom': 'Cadres et professions intellectuelles supérieures'}, {'csp_id': 4, 'csp_nom': 'Professions intermédiaires'}, {'csp_id': 5, 'csp_nom': 'Employés'}, {'csp_id': 6, 'csp_nom': 'Ouvriers'}, {'csp_id': 7, 'csp_nom': 'Retraités'}, {'csp_id': 8, 'csp_nom': 'Autres personnes sans activité professionnelle'}, {'csp_id': 9, 'csp_nom': 'Total'})
2020-12-02 22:33:00,886 INFO sqlalchemy.engine.base.Engine COMMIT

In [51]:
age.to_sql('age', con=engine, if_exists='append', index=False)

2020-12-02 22:33:00,903 INFO sqlalchemy.engine.base.Engine DESCRIBE `age`
2020-12-02 22:33:00,906 INFO sqlalchemy.engine.base.Engine {}
2020-12-02 22:33:00,914 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2020-12-02 22:33:00,916 INFO sqlalchemy.engine.base.Engine INSERT INTO age (ag_id, ag_tranche_age) VALUES (%(ag_id)s, %(ag_tranche_age)s)
2020-12-02 22:33:00,918 INFO sqlalchemy.engine.base.Engine ({'ag_id': 1, 'ag_tranche_age': '15 a 24'}, {'ag_id': 2, 'ag_tranche_age': '25 a 54'}, {'ag_id': 3, 'ag_tranche_age': '55 et plus'})
2020-12-02 22:33:00,920 INFO sqlalchemy.engine.base.Engine COMMIT

In [52]:
categorie_logement.to_sql('categorie_logement', con=engine, if_exists='append', index=False)

2020-12-02 22:33:00,943 INFO sqlalchemy.engine.base.Engine DESCRIBE `categorie_logement`
2020-12-02 22:33:00,945 INFO sqlalchemy.engine.base.Engine {}
2020-12-02 22:33:00,958 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2020-12-02 22:33:00,960 INFO sqlalchemy.engine.base.Engine INSERT INTO categorie_logement (cl_id, cl_nom) VALUES (%(cl_id)s, %(cl_nom)s)
2020-12-02 22:33:00,961 INFO sqlalchemy.engine.base.Engine ({'cl_id': 1, 'cl_nom': 'Résidences principales'}, {'cl_id': 2, 'cl_nom': 'Résid. secondaires et log. occasionnels'}, {'cl_id': 3, 'cl_nom': 'Logements vacants'}, {'cl_id': 4, 'cl_nom': 'Total'})
2020-12-02 22:33:00,965 INFO sqlalchemy.engine.base.Engine COMMIT

In [53]:
logement.to_sql('logement', con=engine, if_exists='append', index=False)

2020-12-02 22:33:00,982 INFO sqlalchemy.engine.base.Engine DESCRIBE `logement`
2020-12-02 22:33:00,986 INFO sqlalchemy.engine.base.Engine {}
2020-12-02 22:33:00,994 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2020-12-02 22:33:00,996 INFO sqlalchemy.engine.base.Engine INSERT INTO logement (lo_id, lo_nbre, lo_vi_id_fk, lo_cl_id_fk) VALUES (%(lo_id)s, %(lo_nbre)s, %(lo_vi_id_fk)s, %(lo_cl_id_fk)s)
2020-12-02 22:33:01,003 INFO sqlalchemy.engine.base.Engine ({'lo_id': 1, 'lo_nbre': 11339, 'lo_vi_id_fk': 4, 'lo_cl_id_fk': 1}, {'lo_id': 2, 'lo_nbre': 8403, 'lo_vi_id_fk': 3, 'lo_cl_id_fk': 1}, {'lo_id': 3, 'lo_nbre': 21276, 'lo_vi_id_fk': 2, 'lo_cl_id_fk': 1}, {'lo_id': 4, 'lo_nbre': 37735, 'lo_vi_id_fk': 1, 'lo_cl_id_fk': 1}, {'lo_id': 5, 'lo_nbre': 694, 'lo_vi_id_fk': 5, 'lo_cl_id_fk': 1}, {'lo_id': 6, 'lo_nbre': 8694, 'lo_vi_id_fk': 4, 'lo_cl_id_fk': 2}, {'lo_id': 7, 'lo_nbre': 1983, 'lo_vi_id_fk': 3, 'lo_cl_id_fk': 2}, {'lo_id': 8, 'lo_nbre': 4104, 'lo_vi_id_fk': 2, 'lo_cl_id_fk': 2}  ... displaying 10 of 20 total bound parameter sets ...  {'lo_id': 19, 'lo_nbre': 71264, 'lo_vi_id_fk': 1, 'lo_cl_id_fk': 4}, {'lo_id': 20, 'lo_nbre': 3335, 'lo_vi_id_fk': 5, 'lo_cl_id_fk': 4})
2020-12-02 22:33:01,008 INFO sqlalchemy.engine.base.Engine COMMIT

In [54]:
population.to_sql('population', con=engine, if_exists='append', index=False)

2020-12-02 22:33:01,026 INFO sqlalchemy.engine.base.Engine DESCRIBE `population`
2020-12-02 22:33:01,029 INFO sqlalchemy.engine.base.Engine {}
2020-12-02 22:33:01,039 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2020-12-02 22:33:01,042 INFO sqlalchemy.engine.base.Engine INSERT INTO population (po_id, po_source, po_annee, po_nbre_pop, po_csp_id_fk, po_ag_id_fk, po_vi_id_fk) VALUES (%(po_id)s, %(po_source)s, %(po_annee)s, %(po_nbre_pop)s, %(po_csp_id_fk)s, %(po_ag_id_fk)s, %(po_vi_id_fk)s)
2020-12-02 22:33:01,043 INFO sqlalchemy.engine.base.Engine ({'po_id': 0, 'po_source': 'Insee, Recensement de la population (RP), exploitation complémentaire - 2017', 'po_annee': 2017, 'po_nbre_pop': 0, 'po_csp_id_fk': 1, 'po_ag_id_fk': 1, 'po_vi_id_fk': 4}, {'po_id': 1, 'po_source': 'Insee, Recensement de la population (RP), exploitation complémentaire - 2017', 'po_annee': 2017, 'po_nbre_pop': 0, 'po_csp_id_fk': 1, 'po_ag_id_fk': 1, 'po_vi_id_fk': 3}, {'po_id': 2, 'po_source': 'Insee, Recensement de la population (RP), exploitation complémentaire - 2017', 'po_annee': 2017, 'po_nbre_pop': 0, 'po_csp_id_fk': 1, 'po_ag_id_fk': 1, 'po_vi_id_fk': 2}, {'po_id': 3, 'po_source': 'Insee, Recensement de la population (RP), exploitation complémentaire - 2017', 'po_annee': 2017, 'po_nbre_pop': 0, 'po_csp_id_fk': 1, 'po_ag_id_fk': 1, 'po_vi_id_fk': 1}, {'po_id': 4, 'po_source': 'Insee, Recensement de la population (RP), exploitation complémentaire - 2017', 'po_annee': 2017, 'po_nbre_pop': 0, 'po_csp_id_fk': 1, 'po_ag_id_fk': 1, 'po_vi_id_fk': 5}, {'po_id': 5, 'po_source': 'Insee, Recensement de la population (RP), exploitation complémentaire - 2017', 'po_annee': 2017, 'po_nbre_pop': 16, 'po_csp_id_fk': 2, 'po_ag_id_fk': 1, 'po_vi_id_fk': 4}, {'po_id': 6, 'po_source': 'Insee, Recensement de la population (RP), exploitation complémentaire - 2017', 'po_annee': 2017, 'po_nbre_pop': 34, 'po_csp_id_fk': 2, 'po_ag_id_fk': 1, 'po_vi_id_fk': 3}, {'po_id': 7, 'po_source': 'Insee, Recensement de la population (RP), exploitation complémentaire - 2017', 'po_annee': 2017, 'po_nbre_pop': 26, 'po_csp_id_fk': 2, 'po_ag_id_fk': 1, 'po_vi_id_fk': 2}  ... displaying 10 of 135 total bound parameter sets ...  {'po_id': 133, 'po_source': 'Insee, Recensement de la population (RP), exploitation complémentaire - 2017', 'po_annee': 2017, 'po_nbre_pop': 31161, 'po_csp_id_fk': 9, 'po_ag_id_fk': 3, 'po_vi_id_fk': 1}, {'po_id': 134, 'po_source': 'Insee, Recensement de la population (RP), exploitation complémentaire - 2017', 'po_annee': 2017, 'po_nbre_pop': 623, 'po_csp_id_fk': 9, 'po_ag_id_fk': 3, 'po_vi_id_fk': 5})
2020-12-02 22:33:01,060 INFO sqlalchemy.engine.base.Engine COMMIT

In [55]:
entreprise.to_sql('entreprise', con=engine, if_exists='append', index=False)

2020-12-02 22:33:01,076 INFO sqlalchemy.engine.base.Engine DESCRIBE `entreprise`
2020-12-02 22:33:01,077 INFO sqlalchemy.engine.base.Engine {}
2020-12-02 22:33:01,085 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2020-12-02 22:33:01,122 INFO sqlalchemy.engine.base.Engine INSERT INTO entreprise (en_id, en_siren, en_nic, en_nom, en_sa_id_fk, en_adresse, en_code_postal, en_vi_id_fk) VALUES (%(en_id)s, %(en_siren)s, %(en_nic)s, %(en_nom)s, %(en_sa_id_fk)s, %(en_adresse)s, %(en_code_postal)s, %(en_vi_id_fk)s)
2020-12-02 22:33:01,123 INFO sqlalchemy.engine.base.Engine ({'en_id': 631096522, 'en_siren': 6310965, 'en_nic': 22, 'en_nom': None, 'en_sa_id_fk': 12, 'en_adresse': ' av gaston de fontmichel', 'en_code_postal': '06210', 'en_vi_id_fk': 4}, {'en_id': 1558007934, 'en_siren': 15580079, 'en_nic': 34, 'en_nom': 'societe immobiliere walter sperger', 'en_sa_id_fk': 12, 'en_adresse': '2 bd leader', 'en_code_postal': '06150', 'en_vi_id_fk': 1}, {'en_id': 1976012318, 'en_siren': 19760123, 'en_nic': 18, 'en_nom': 'ctim noailles', 'en_sa_id_fk': 14, 'en_adresse': '17 av de grasse', 'en_code_postal': '06400', 'en_vi_id_fk': 1}, {'en_id': 1976014913, 'en_siren': 19760149, 'en_nic': 13, 'en_nom': 'ctim durango', 'en_sa_id_fk': 14, 'en_adresse': '116 bd sadi carnot', 'en_code_postal': '06110', 'en_vi_id_fk': 2}, {'en_id': 1976020611, 'en_siren': 19760206, 'en_nic': 11, 'en_nom': 'ctim residence gallia', 'en_sa_id_fk': 14, 'en_adresse': '27 bd montfleury', 'en_code_postal': '06400', 'en_vi_id_fk': 1}, {'en_id': 1976090910, 'en_siren': 19760909, 'en_nic': 10, 'en_nom': 'ctim grand sud', 'en_sa_id_fk': 14, 'en_adresse': '1 bd sadi carnot', 'en_code_postal': '06110', 'en_vi_id_fk': 2}, {'en_id': 1976121218, 'en_siren': 19761212, 'en_nic': 18, 'en_nom': 'ctim emeraude', 'en_sa_id_fk': 14, 'en_adresse': '7 rue du lac', 'en_code_postal': '06400', 'en_vi_id_fk': 1}, {'en_id': 1976151916, 'en_siren': 19761519, 'en_nic': 16, 'en_nom': 'ctim villa lerina', 'en_sa_id_fk': 14, 'en_adresse': '63 bd de la croisette', 'en_code_postal': '06400', 'en_vi_id_fk': 1}  ... displaying 10 of 2000 total bound parameter sets ...  {'en_id': 32131425412, 'en_siren': 321314254, 'en_nic': 12, 'en_nom': 'soc particuliere janau', 'en_sa_id_fk': 12, 'en_adresse': '70 rue georges clemenceau', 'en_code_postal': '06400', 'en_vi_id_fk': 1}, {'en_id': 32133932717, 'en_siren': 321339327, 'en_nic': 17, 'en_nom': None, 'en_sa_id_fk': 17, 'en_adresse': '23 rue jean de riouffe', 'en_code_postal': '06400', 'en_vi_id_fk': 1})
2020-12-02 22:33:01,280 INFO sqlalchemy.engine.base.Engine COMMIT